Reports/Продажи_Ждановский_БазовыйРеестрОтзывовПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>Продажи_Ждановский_БазовыйРеестрОтзывовПродаж</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЗадачиЗвонокЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиЗвонокЛояльности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Comment>Другие телефоны контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу (если есть linked ID) иначе  телефон оператора закрытия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой необходимо исполнить задачу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Владелец объекта после события купли-продажи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНедозвонов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Comment>Заметка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СигнатураПродажи</Name>
					<Comment>Сигнатура продажи или сигнатура пакета продажи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Продажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество автомобилей при продаже автомобилей, при ремонтах - количество часов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точка</Name>
					<Comment>С 05.06.2020 для заказ-нарядов ОУ точка заказ-наряда подменяется точкой машинозаезда, т.к. это могут быть разные точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время события (совпадает с датой документа - регистратора)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопДата</Name>
					<Comment>Дополнительная дата: для заказ-наряда это дата окончания (закрытия)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Comment>Виды событий: "продажа", "ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Возможен список значений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОбъекта</Name>
					<Comment>Комлектация/ВидРемонта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Наименование покупателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента (контрагента)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникГУИД</Name>
					<Comment>ГУИД сотрудника из базы-источника. Для ОУ - это не сотрудник из реализации, а сотрудник из сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеСотрудники</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>ГУИД покупателя из базы-источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Для заказ-нарядов новой ОУСТО - дата приемки авто (ЗаказНаряд.ДатаНачалаФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пакет</Name>
					<Comment>Пакет продаж, в который входит данный документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Для новой ОУ СТО - дата окончания факт (ДатаОкончанияФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Наименование контактного лица</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магистральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машинозаезд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаЗаказНаряда</Name>
					<Comment>Истинная точка заказ-наряда, не подменяемая на точку машинозаезда</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ТипЗадачи</Name>
			<Comment>Тип задачи</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Непринятый</Name>
					<Comment>Перезвонить абоненту непринятого звонка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛояльностьПродажАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛояльностьРемонтаАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепринятыйИсходящий</Name>
					<Comment>Относится к автозвонку (был исходящий со стороны КЦ, но он не принят абонентом)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сброс</Name>
					<Comment>Задача создана вручную операторм контакт-центра из консоли, т.к. он посчитал, что произошел сброс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/Продажи_Ждановский_БазовыйРеестрОтзывовПродаж/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиЗвонокЛояльности.СигнатураПродажи КАК СигнатураЗадачи,
	|	ЗадачиЗвонокЛояльности.Телефон КАК Телефон,
	|	Продажи.Точка КАК Точка,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник,
	|	Продажи.Объект КАК Автомобиль,
	|	ЗадачиЗвонокЛояльности.ДатаЗакрытия КАК ДатаЗакрытия
	|ПОМЕСТИТЬ ВТ01_Задачи
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачиЗвонокЛояльности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ЗадачиЗвонокЛояльности.СигнатураПродажи = Продажи.Сигнатура
	|			И (Продажи.Объект ПОДОБНО ""%Vin: Z783%"")
	|ГДЕ
	|	ЗадачиЗвонокЛояльности.ДатаЗакрытия МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаПериодаЗакрытияЗадач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|	И ЗадачиЗвонокЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьПродажАвто)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыРасширенные.СигнатураЗадачи КАК СигнатураЗадачи,
	|	АнкетыРасширенные.Вопрос КАК Вопрос,
	|	АнкетыРасширенные.Ответ КАК Ответ,
	|	АнкетыРасширенные.ОтветКомментарий.ПолнаяСтрока КАК ОтветКомментарий,
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Точка КАК Точка,
	|	ВТ01.Номер КАК Номер,
	|	ВТ01.Дата КАК Дата,
	|	ВТ01.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ01.Сотрудник КАК Сотрудник,
	|	ВТ01.Автомобиль КАК Автомобиль,
	|	ВТ01.ДатаЗакрытия КАК ДатаЗакрытия
	|ПОМЕСТИТЬ ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК АнкетыРасширенные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО (ВТ01.СигнатураЗадачи = АнкетыРасширенные.СигнатураЗадачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи КАК СигнатураЗадачи,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос КАК Вопрос,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.ДатаЗакрытия КАК ДатаЗакрытия
	|ПОМЕСТИТЬ ВТ03_ОтборПоВопросам
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ГДЕ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос = &Вопрос1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02.Точка КАК Точка,
	|	ВТ02.Номер КАК Номер,
	|	ВТ02.Дата КАК Дата,
	|	ВТ02.Сотрудник КАК Сотрудник,
	|	ВТ02.Автомобиль КАК Автомобиль,
	|	ВТ02.Телефон КАК Телефон,
	|	ВТ02.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ02.СигнатураЗадачи КАК СигнатураЗадачи,
	|	ВТ02.Вопрос КАК Вопрос,
	|	ВТ02.Ответ КАК Ответ,
	|	ВТ02.ОтветКомментарий КАК ОтветКомментарий,
	|	ВТ02.ДатаЗакрытия КАК ДатаЗакрытия,
	|	""pr_"" + ВТ02.СигнатураЗадачи КАК ОписаниеЗадачиКакОснованиеЗвонка
	|ПОМЕСТИТЬ ВТ04_БезЗвонков
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03_ОтборПоВопросам КАК ВТ03_Отбор
	|		ПО ВТ02.СигнатураЗадачи = ВТ03_Отбор.СигнатураЗадачи
	|			И ВТ02.Вопрос = ВТ03_Отбор.Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗвонкиСтат.Сигнатура КАК СигнатураЗвонка,
	|	Звонки.Дата КАК ДатаЗвонка,
	|	ВТ04.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ05_Звонки_ИхМожетБытьНесколькоНаОднуЗадачу
	|ИЗ
	|	РегистрСведений.ЗвонкиСтатОбщая КАК ЗвонкиСтат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Звонки КАК Звонки
	|		ПО ЗвонкиСтат.Сигнатура = Звонки.Сигнатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ04_БезЗвонков КАК ВТ04
	|		ПО ЗвонкиСтат.Основание = ВТ04.ОписаниеЗадачиКакОснованиеЗвонка
	|			И (Звонки.Принят = ИСТИНА)
	|			И (НАЧАЛОПЕРИОДА(Звонки.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(Звонки.Дата, ДЕНЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ05.СигнатураЗадачи КАК СигнатураЗадачи,
	|	МАКСИМУМ(ВТ05.ДатаЗвонка) КАК ДатаЗвонка
	|ПОМЕСТИТЬ ВТ06_ДатыПозднейшегоЗвонкаПоЗадаче
	|ИЗ
	|	ВТ05_Звонки_ИхМожетБытьНесколькоНаОднуЗадачу КАК ВТ05
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ05.СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ05.СигнатураЗвонка КАК СигнатураЗвонка,
	|	ВТ05.ДатаЗвонка КАК ДатаЗвонка,
	|	ВТ05.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ07_ОднаЗадачаПоследнийЗвонок
	|ИЗ
	|	ВТ05_Звонки_ИхМожетБытьНесколькоНаОднуЗадачу КАК ВТ05
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ06_ДатыПозднейшегоЗвонкаПоЗадаче КАК ВТ06
	|		ПО ВТ05.ДатаЗвонка = ВТ06.ДатаЗвонка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ04.Точка КАК Точка,
	|	ВТ04.Номер КАК Номер,
	|	ВТ04.Дата КАК Дата,
	|	ВТ04.Сотрудник КАК Сотрудник,
	|	ВТ04.Автомобиль КАК Автомобиль,
	|	ВТ04.Телефон КАК Телефон,
	|	ВТ04.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ04.СигнатураЗадачи КАК СигнатураЗадачи,
	|	ВТ04.Вопрос КАК Вопрос,
	|	ВТ04.Ответ КАК Ответ,
	|	ВТ04.ОтветКомментарий КАК ОтветКомментарий,
	|	ВТ07.СигнатураЗвонка КАК СигнатураЗвонка
	|ИЗ
	|	ВТ04_БезЗвонков КАК ВТ04
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ07_ОднаЗадачаПоследнийЗвонок КАК ВТ07
	|		ПО ВТ04.СигнатураЗадачи = ВТ07.СигнатураЗадачи";
	Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач",	ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачалаПериодаЗакрытияЗадач")).Значение); 
	Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач",	ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонцаПериодаЗакрытияЗадач")).Значение); 
	Запрос.УстановитьПараметр("Вопрос1", 						ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Вопрос1")).Значение);
	
	Результат = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат ТЗ;
	//КонецЕсли;
	
	ТЗ = Результат.Выгрузить();
	
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	СКД = ПолучитьМакет("МакетНаТЗ");
	Настройки = СКД.НастройкиПоУмолчанию;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	

	
							
КонецПроцедуры
